# YOLOv12n-SimAM: Integrates SimAM attention before Detect head inputs.
# Focus: Refine P3/P4/P5 features for potentially better detection, including small objects.
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n-simam.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.50, 0.25, 1024] # Adjust params/GFLOPs based on SimAM addition (negligible param increase)
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLOv12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 (save P3)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6 (save P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8 (save P5)

# YOLOv12n-SimAM head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4
  - [-1, 2, A2C2f, [512, False, -1]] # 11 (P4 head out)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3
  - [-1, 2, A2C2f, [256, False, -1]] # 14 (P3 head out)
  - [-1, 1, SimAM, []]  # 15 Add SimAM after P3 processing <<<--- ADDED

  - [-2, 1, Conv, [256, 3, 2]] # 16 Downsample P3 path (from layer 14)
  - [[-1, 11], 1, Concat, [1]] # 17 cat head P4 (layer 11)
  - [-1, 2, A2C2f, [512, False, -1]] # 18 (P4 head out')
  - [-1, 1, SimAM, []]  # 19 Add SimAM after P4 processing <<<--- ADDED

  - [-2, 1, Conv, [512, 3, 2]] # 20 Downsample P4 path (from layer 18)
  - [[-1, 8], 1, Concat, [1]] # 21 cat head P5 (layer 8)
  - [-1, 2, C3k2, [1024, True]] # 22 (P5 head out)
  - [-1, 1, SimAM, []]  # 23 Add SimAM after P5 processing <<<--- ADDED

  - [[15, 19, 23], 1, Detect, [nc]] # Detect(P3, P4, P5) inputs from SimAM layers